import React from 'react';
import { Container } from 'react-bootstrap';

const Rules = () => {
  return (
    <Container className='text-white py-6'>
      <p className="rules-title text-uppercase">ПРАВИЛА ТУРНИРОВ CYBER SPORT</p>
      <p className="rules-description">
        Настоящим определяются правила проведения Турниров. <br/>
        Правила обязательны для исполнения всеми участниками и командами участников, принимающими участие в каком-либо Турнире на стриминговой киберспортивной платформе CYBER SPORT (далее — Платформа CYBER SPORT). Регистрация на Турнир означает ваше полное и безоговорочное согласие с настоящими правилами. <br/>
        Компания Apple не имеет никакого отношения к Турнирам, не участвует в них и не является спонсором каких-либо Турниров.
      </p>
      <p className="rules-title text-uppercase">
        1. ФОРМАТ ПРОВЕДЕНИЯ
      </p>
      <p className="rules-description">
      Формат Турнира <br/>
      Существуют турниры в соло режиме и командные турниры. <br/>
      Турнир может быть проведен в один или несколько этапов, что зависит от того, какое максимальное количество участников допускается конкретной игрой для добавления их в одно игровое лобби такой игры. Каждый этап состоит из одного или нескольких матчей (конкретных игр). <br/>
      Победитель Турнира в один этап определяется по количеству набранных очков в игре в рамках одного или нескольких матчей. В матче выигрывает участник или участники (в зависимости от количества призовых мест в Турнире), набравший наибольшее количество очков в соответствии с условиями конкретного Турнира. <br/>
      Победитель Турнира в несколько этапов определяется на последнем этапе (в финале) по количеству набранных на последнем этапе очков без учета очков, набранных на предыдущих этапах, а именно: по сумме очков в рамках одного или нескольких финальных матчей. <br/>
      Очки начисляются за место, занятое в игре, за количество поверженных противников и за дополнительные показатели, которые при наличии обязательно указываются в Карточке турнира.
      </p>
      <p className="rules-title text-uppercase">
        2. ИНФОРМАЦИЯ О ТУРНИРЕ
      </p>
      <p className="rules-description">
        Каждая Карточка турнира содержит информацию об организаторе Турнира, сроках проведения Турнира, виде Турнира, режиме турнира, стоимости участия в Турнире, участниках, зарегистрированных на Турнир, о максимальном количестве участников, которое может принять участие в Турнире, о размере призового фонда и его распределении на призы в зависимости от количества призовых мест в Турнире.
      </p>
      <p className="rules-title text-uppercase">
        3. РЕГИСТРАЦИЯ НА ТУРНИР
      </p>
      <p className="rules-description">
      Чтобы принять участие в Турнире, необходимо пройти регистрацию на Турнир на Платформе CYBER SPORT, для чего необходимо выбрать интересующий вас Турнир в разделе Турниров и нажать кнопку регистрации. В случае если участие в Турнире осуществляется за билеты, необходимо приобрести нужное количество билетов и оплатить ими участие в Турнире. <br/>
      Регистрацию на турнир с командным участием осуществляет капитан команды. При регистрации на такой турнир у каждого участника списываются билеты пропорционально количеству участников команды. Участник, который вступил в команду согласился с тем, что капитан регистристрируется на турнир от лица всей команды и что при такой регистрации у всех участников команды списываются билеты пропорционально количеству участников. <br/>
      Чтобы отменить регистрацию на турнир, необходимо не позднее, чем за 2 (два) часа до начала Турнира зайти в Карточку турнира и нажать кнопку, позволяющую отменить регистрацию. В этом случае билеты на Турнир возвращаются вам и отображаются в личном кабинете. <br/>
      В случае если вы не отменили регистрацию на Турнир, но не участвовали в нем, или попытались отменить регистрацию позднее, чем за 2 (два) часа до Турнира, вы будете указаны в итоговой таблице результатов Турнира с нулевым результатом. Билеты на Турнир в таком случае не возвращаются. <br/>
      В случае, если команда зарегистрирована на командный турнир в ней невозможно проводить какие-либо изменения, в том числе нельзя выйти из команды или удалить участника из команды, а также удалить команду или изменить любые данные команды. <br/>
      Организаторы Турнира оставляют за собой право отказать в регистрации любому участнику без объяснения причин.
      </p>
      <p className="rules-title text-uppercase">
        4. ПОДГОТОВКА К МАТЧУ
      </p>
      <p className="rules-description">
      После регистрации, Турнир на который вы зарегистрировались, появится в вашем календаре в личном кабинете, а в случае участия в командном турнире, то после регистрации команды капитаном, турнир появится в календаре в личном кабинете у каждого участника команды. <br/>
      За 10 минут до старта матча в вашем личном кабинете или в Карточке турнира появится активная кнопка, позволяющая перейти в комнату матча. Пройдя проверку на читы и нажав кнопку, участник попадает в комнату матча, где ему необходимо ввести свой игровой никнейм, под которым он будет принимать участие в конкретном матче, после чего он автоматически получает необходимые данные для доступа во внутриигровое лобби. Эти данные участник должен ввести в поля ввода до момента начала матча, чтобы принять в нем участие. <br/>
      В случае участия в командном турнире, команда получит необходимые данные для доступа во внутриигровое лобби только после ввода никнейма каждого участника команды. В случае, если хотя бы один из участников команды не введет свой никнейм, команда не сможет участвовать в турнире.
      </p>
      <p className="rules-title text-uppercase">
        5. АНТИ-ЧИТ
      </p>
      <p className="rules-description">
      До того, как вы попадете в комнату матча, наша Анти-чит система проверит ваше устройство на наличие читерского ПО. <br/>
      В случае, если на вашем устройстве не установлено наше Анти-чит мобильное приложение, Платформа попросит вас его скачать, установить, зайти в нужный турнир и получить данные по матчу. <br/>
      В случае, если ваше устройство не содержит читерского ПО, вы будете допущены в комнату матча. <br/>
      В случае, если на вашем устройстве будет обнаружено читерское ПО, вы не сможете перейти в комнату матча, а возможность вывода любых выигранных вами призов будет заблокирована до окончания расследования по инциденту, даже если эти призы были выиграны вами до того, как вас уличили в использовании читерского ПО. <br/>
      Если в результате расследования выяснится, что вы использовали читерское ПО, ваш аккаунт будет заблокирован без права на восстановление или создания другого аккаунта с этого же устройства.
      </p>
        <p className="rules-title text-uppercase">
        6. НАЧАЛО МАТЧА
      </p>
      <p className="rules-description">
      Матч начинается в момент, когда истек срок на вход в игру и судья или комментатор Турнира (назначаются организатором Турнира) нажимают кнопку для начала игры. <br/>
      Участник, опоздавший к началу матча, не получает очки за матч, при этом никнейм участника будет отражен в итоговой таблице результатов Турнира с нулевым результатом. Если к началу матча опоздал участник команды командного турнира, команда не получает очки за матч, при этом название команды и никнеймы участников будут отражены в итоговой таблице результатов Турнира с нулевым результатом.
      </p>
        <p className="rules-title text-uppercase">
        7. ИЗМЕНЕНИЯ В РАСПИСАНИИ ТУРНИРА
      </p>
      <p className="rules-description">
      Организаторы Турнира оставляют за собой право вносить изменения в расписание матчей Турнира. Изменения в расписании незамедлительно отображаются в Карточке турнира, а также в календаре в личном кабинете каждого участника Турнира. Информация о переносе матча или Турнира и причине такого переноса будет направляться участникам при помощи уведомлений.
      </p>
        <p className="rules-title text-uppercase">
        8. НАРУШЕНИЕ ПРАВИЛ ТУРНИРА
      </p>
      <p className="rules-description">
      Нарушение правил Турнира может привести к дисквалификации игрока или всей команды, а именно к запрету на участие в Турнирах на 24 часа, 72 часа или навсегда, к запрету на вывод призов, или же к запрету на использование учетной записи без возможности регистрации нового аккаунта. <br/>
      К нарушениям относятся: <br/>
      оскорбление других участников, зрителей, судей, комментаторов или организаторов Турнира; <br/>
      создание помех для проведения Турнира; <br/>
      участие в Турнире под чужой учетной записью; <br/>
      преднамеренно играть плохо, ниже уровня своего мастерства, чтобы соответствовать менее опытному участнику; <br/>
      участие в каких-либо Турнирах с помощью ботов, программ, читов, или аналогичных методов, использование эмулятора на десктопе, позволяющего играть в мобильную игру на десктопном устройстве, либо совершение иного рода мошеннических действий в отношении Платформы CYBER SPORT (все вместе - читерское ПО). Любая попытка сделать это приведет к прекращению вашего доступа к вашей учетной записи, а также к призам и билетам. Организатор Турнира оставляет за собой право прекратить доступ к любой учетной записи, владелец которой подозревается в подделке результатов своей игры для участия в Турнире или иным образом нарушил настоящие правила; <br/>
      участие в тиминге - объединении нескольких игроков в соло режиме, чтобы командой в сговоре убивать одиночных игроков; <br/>
      распространять ID лобби и пароль, а также приглашать сторонних третьих лиц не зарегистрированных в Турнире посредством сервиса самой игры; <br/>
      нарушать Условия использования платформы “CYBER SPORT”.
      </p>
      <p className="rules-title text-uppercase">
        9. СУДЕЙСТВО
      </p>
      <p className="rules-description">
      В случае если организатором Турнира был назначен судья на матч, судья следит за тем, чтобы игра велась честно и без нарушений. <br/>
      Все участники, желающие сообщить о нарушениях, должны обратиться к организатору Турнира посредством формы обратной связи в личном кабинете в течение 24 часов после окончания матча. В случае если сообщение от участника поступит позднее указанного срока, такое сообщение не будет учитываться организатором Турнира. <br/>
      Решения по спорным вопросам выносит организатор Турнира в течение 48 часов после окончания матча. <br/>
      Решение по спорному вопросу, вынесенное организатором Турнира, является окончательным. <br/>
      Результатом решения по спорному вопросу может стать дисквалификация команды участников или участника, что означает обнуление результата команды участников в конкретном спорном матче, а также запрет на участие в Турнирах на срок 24 часа, 72 часа или навсегда, или же к запрету на использование учетной записи. <br/>
      О решении по спорному вопросу участники узнают из информации, размещенной в Карточке матча. <br/>
      Дисквалифицированная команда участников или участник теряют право на получение призов за Турнир, с которого она или он были дисквалифицированы.
      </p>
      <p className="rules-title text-uppercase">
        10. РЕЗУЛЬТАТ
      </p>
      <p className="rules-description">
      Список победителей размещается в Карточке матча и Карточке турнира после завершения матча или всего Турнира. <br/>
      Результаты и победители каждого Турнира определяются Платформой CYBER SPORT автоматически с учетом фактических данных игры. <br/>
      После определения победителя или команды победителей, ему автоматически начисляются очки, которые отображаются в карточке турнира в в разделе “Результаты”. <br/>
      Дата последнего обновления: «27» августа 2020 года
      </p>
    </Container>
  )
};

export default Rules;
